// তুই teacher নামে একটা অবজেক্ট বানা। এইটার মধ্যে টিচারের নাম থাকবে। উনি কোন সাবজেক্ট পড়ান, সেটার নাম থাকবে; স্যারের বয়স, বাসা কোথায়— এই টাইপের পাঁচটা জিনিস থাকবে। 
console.log('তুই teacher নামে একটা অবজেক্ট বানা। এইটার মধ্যে টিচারের নাম থাকবে। উনি কোন সাবজেক্ট পড়ান, সেটার নাম থাকবে; স্যারের বয়স, বাসা কোথায়— এই টাইপের পাঁচটা জিনিস থাকবে। ');

const teacher = {
  Name: 'Salam',
  Subject: 'Science',
  Age: 45,
  Address: 'Sarulia, Demra, Dhaka'
}

console.log(teacher);

// গাছ (tree) নামে একটা object তৈরি কর, যার মধ্যে থাকবে, এইটা কী গাছ, উচ্চতা কেমন, বয়স কত, ফলের নাম কী ইত্যাদি।
console.log('গাছ (tree) নামে একটা object তৈরি কর, যার মধ্যে থাকবে, এইটা কী গাছ, উচ্চতা কেমন, বয়স কত, ফলের নাম কী ইত্যাদি।');

const tree = {
  Name: 'Mango Tree',
  Height: 20, //ft
  Age: 20, //years
  Fruit: 'Mango', 
}
console.log(tree);

// তোর আশেপাশে কোনো প্রাণী থাকলে (গরু, বিড়াল, কুকুর, ইঁদুর, তেলাপোকা, মশা, মাছি, পিঁপড়া, টিকটিকি, মানুষ বা অন্য কোনো প্রাণী থাকলে), সেটার জন্য একটা অবজেক্ট লিখে ফেল।
console.log('তোর আশেপাশে কোনো প্রাণী থাকলে (গরু, বিড়াল, কুকুর, ইঁদুর, তেলাপোকা, মশা, মাছি, পিঁপড়া, টিকটিকি, মানুষ বা অন্য কোনো প্রাণী থাকলে), সেটার জন্য একটা অবজেক্ট লিখে ফেল।');

// তোর আব্বুর জন্য father নামে একটা অবজেক্ট বানিয়ে ফেল। সেখানে উনার নাম, পেশা, বয়স, সন্তানের সংখ্যা ইত্যাদি তথ্য দিয়ে ফেল।

console.log('তোর আব্বুর জন্য father নামে একটা অবজেক্ট বানিয়ে ফেল। সেখানে উনার নাম, পেশা, বয়স, সন্তানের সংখ্যা ইত্যাদি তথ্য দিয়ে ফেল।');

const father = {
  Name: 'Sanaullah',
  Occupation: 'Business',
  Age: 60,
  Children:4,
}

console.log(father);

// একটা বাইক(motorbike) নিয়ে object বানা। সেখানে ব্রান্ডের নাম, টায়ারের সংখ্যা, রং, সর্বোচ্চ গতি আর দাম থাকবে।

console.log('একটা বাইক(motorbike) নিয়ে object বানা। সেখানে ব্রান্ডের নাম, টায়ারের সংখ্যা, রং, সর্বোচ্চ গতি আর দাম থাকবে।');

const bike = {
  Brand: 'Discover',
  Tyer: 2,
  Color:'Red',
  Speed:70
}

console.log(bike);

// একটি পাখি (bird) অবজেক্ট তৈরি কর, যেখানে পাখির নাম, রং, খাদ্য ইত্যাদি প্রপার্টি থাকবে।
console.log('একটি পাখি (bird) অবজেক্ট তৈরি কর, যেখানে পাখির নাম, রং, খাদ্য ইত্যাদি প্রপার্টি থাকবে।');

const bird = {
  Name: 'Tuntuni',
  Color: 'Green',
  Food: 'Nity grits'
}
console.log(bird);

// একটা laptop অবজেক্ট তৈরি কর, যেখানে থাকবে ব্রান্ডের নাম, প্রসেসর, র‍্যাম, দাম, আর ডিসপ্লের সাইজ ইত্যাদি ডাটা থাকবে।
console.log('একটা laptop অবজেক্ট তৈরি কর, যেখানে থাকবে ব্রান্ডের নাম, প্রসেসর, র‍্যাম, দাম, আর ডিসপ্লের সাইজ ইত্যাদি ডাটা থাকবে।');

const laptop ={
  Brand: 'Dell',
  Processor: 3.4,
  Ram: 16,
  Display: 18,
  Price: 30000
}

console.log(laptop);